Tests/sysbench_results_r7a.2xlarge_20250606_051735.txt
=====================================================================
SYSBENCH COMPREHENSIVE BENCHMARK RESULTS
=====================================================================
Start Time: Fri Jun  6 05:17:35 UTC 2025
Hostname: i-088c3e7d009b5997a.8067.aws-int.thomsonreuters.com
Instance Type: r7a.2xlarge
Operating System: Linux i-088c3e7d009b5997a.8067.aws-int.thomsonreuters.com 6.1.130-139.222.amzn2023.x86_64 #1 SMP PREEMPT_DYNAMIC Tue Mar 11 01:10:58 UTC 2025 x86_64 x86_64 x86_64 GNU/Linux
CPU Info: AMD EPYC 9R14 AMD EPYC 9R14
CPU Cores: 8
Memory: 61Gi
=====================================================================

[2025-06-06 05:17:35] Starting Sysbench Comprehensive Benchmark Suite
[2025-06-06 05:17:35] Results will be saved to: sysbench_results_r7a.2xlarge_20250606_051735.txt
[2025-06-06 05:17:35] ================================================
[2025-06-06 05:17:35] Checking prerequisites...
[2025-06-06 05:17:35] k6 found - K6 tests will be included
[SUCCESS] Prerequisites check passed
[2025-06-06 05:17:35] Setting up PostgreSQL database and user...
[SUCCESS] PostgreSQL setup completed
[2025-06-06 05:17:35] Starting CPU benchmarks...
[2025-06-06 05:17:35] Detected 8 CPU cores

=====================================================================
SINGLE-CORE CPU BENCHMARK (10 minutes)
=====================================================================

[2025-06-06 05:17:35] Running single-core CPU benchmark (10 minutes)...
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Prime numbers limit: 2000

Initializing worker threads...

Threads started!

[ 10s ] thds: 1 eps: 40157.41 lat (ms,95%): 0.03
[ 20s ] thds: 1 eps: 42682.90 lat (ms,95%): 0.03
[ 30s ] thds: 1 eps: 43635.30 lat (ms,95%): 0.02
[ 40s ] thds: 1 eps: 43001.49 lat (ms,95%): 0.02
[ 50s ] thds: 1 eps: 42811.41 lat (ms,95%): 0.02
[ 60s ] thds: 1 eps: 42813.61 lat (ms,95%): 0.02
[ 70s ] thds: 1 eps: 42361.00 lat (ms,95%): 0.03
[ 80s ] thds: 1 eps: 39810.58 lat (ms,95%): 0.03
[ 90s ] thds: 1 eps: 41943.33 lat (ms,95%): 0.03
[ 100s ] thds: 1 eps: 42816.90 lat (ms,95%): 0.02
[ 110s ] thds: 1 eps: 42811.47 lat (ms,95%): 0.02
CPU speed:
    events per second: 42305.28

Throughput:
    events/s (eps):                      42305.2760
    time elapsed:                        120.0005s
    total number of events:              5076654

Latency (ms):
         min:                                    0.02
         avg:                                    0.02
         max:                                    0.25
         95th percentile:                        0.03
         sum:                               119500.43

Threads fairness:
    events (avg/stddev):           5076654.0000/0.00
    execution time (avg/stddev):   119.5004/0.00

[SUCCESS] Single-core CPU benchmark completed

=====================================================================
MULTI-CORE CPU BENCHMARK (10 minutes)
=====================================================================

[2025-06-06 05:19:35] Running multi-core CPU benchmark (10 minutes)...
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Prime numbers limit: 2000

Initializing worker threads...

Threads started!

[ 10s ] thds: 8 eps: 350939.41 lat (ms,95%): 0.03
[ 20s ] thds: 8 eps: 356676.57 lat (ms,95%): 0.03
[ 30s ] thds: 8 eps: 356458.33 lat (ms,95%): 0.03
[ 40s ] thds: 8 eps: 353200.97 lat (ms,95%): 0.03
[ 50s ] thds: 8 eps: 352356.36 lat (ms,95%): 0.03
[ 60s ] thds: 8 eps: 358086.22 lat (ms,95%): 0.03
[ 70s ] thds: 8 eps: 353088.72 lat (ms,95%): 0.03
[ 80s ] thds: 8 eps: 353567.92 lat (ms,95%): 0.03
[ 90s ] thds: 8 eps: 352323.45 lat (ms,95%): 0.03
[ 100s ] thds: 8 eps: 355769.96 lat (ms,95%): 0.03
[ 110s ] thds: 8 eps: 351753.31 lat (ms,95%): 0.03
CPU speed:
    events per second: 353933.15

Throughput:
    events/s (eps):                      353933.1467
    time elapsed:                        120.0002s
    total number of events:              42472041

Latency (ms):
         min:                                    0.02
         avg:                                    0.02
         max:                                   23.11
         95th percentile:                        0.03
         sum:                               955210.50

Threads fairness:
    events (avg/stddev):           5309005.1250/56441.52
    execution time (avg/stddev):   119.4013/0.01

[SUCCESS] Multi-core CPU benchmark completed
[2025-06-06 05:21:35] Cleaning up PostgreSQL test data...

=====================================================================
POSTGRESQL CLEANUP
=====================================================================

sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Dropping table 'sbtest1'...
Dropping table 'sbtest2'...
Dropping table 'sbtest3'...
Dropping table 'sbtest4'...
Dropping table 'sbtest5'...
Dropping table 'sbtest6'...
Dropping table 'sbtest7'...
Dropping table 'sbtest8'...
Dropping table 'sbtest9'...
Dropping table 'sbtest10'...
[SUCCESS] PostgreSQL cleanup completed
[2025-06-06 05:21:35] Preparing PostgreSQL test data...

=====================================================================
POSTGRESQL DATA PREPARATION
=====================================================================

sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Creating table 'sbtest1'...
Inserting 1000000 records into 'sbtest1'
Creating a secondary index on 'sbtest1'...
Creating table 'sbtest2'...
Inserting 1000000 records into 'sbtest2'
Creating a secondary index on 'sbtest2'...
Creating table 'sbtest3'...
Inserting 1000000 records into 'sbtest3'
Creating a secondary index on 'sbtest3'...
Creating table 'sbtest4'...
Inserting 1000000 records into 'sbtest4'
Creating a secondary index on 'sbtest4'...
Creating table 'sbtest5'...
Inserting 1000000 records into 'sbtest5'
Creating a secondary index on 'sbtest5'...
Creating table 'sbtest6'...
Inserting 1000000 records into 'sbtest6'
Creating a secondary index on 'sbtest6'...
Creating table 'sbtest7'...
Inserting 1000000 records into 'sbtest7'
Creating a secondary index on 'sbtest7'...
Creating table 'sbtest8'...
Inserting 1000000 records into 'sbtest8'
Creating a secondary index on 'sbtest8'...
Creating table 'sbtest9'...
Inserting 1000000 records into 'sbtest9'
Creating a secondary index on 'sbtest9'...
Creating table 'sbtest10'...
Inserting 1000000 records into 'sbtest10'
Creating a secondary index on 'sbtest10'...
[SUCCESS] PostgreSQL test data preparation completed
[2025-06-06 05:23:12] Starting PostgreSQL benchmarks...

=====================================================================
READ-ONLY BENCHMARK (2 minutes)
=====================================================================

[2025-06-06 05:23:12] Running Read-Only benchmark (2 minutes)...
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 8 tps: 9883.39 qps: 158141.40 (r/w/o: 138373.93/0.00/19767.48) lat (ms,95%): 0.86 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 9890.67 qps: 158251.60 (r/w/o: 138470.16/0.00/19781.44) lat (ms,95%): 0.89 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 9796.70 qps: 156746.23 (r/w/o: 137152.94/0.00/19593.29) lat (ms,95%): 0.92 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 8 tps: 9663.51 qps: 154615.02 (r/w/o: 135287.90/0.00/19327.11) lat (ms,95%): 1.04 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 8 tps: 9957.20 qps: 159313.63 (r/w/o: 139399.24/0.00/19914.39) lat (ms,95%): 0.86 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 8 tps: 9959.60 qps: 159356.58 (r/w/o: 139437.37/0.00/19919.21) lat (ms,95%): 0.86 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 8 tps: 10058.30 qps: 160932.51 (r/w/o: 140815.91/0.00/20116.60) lat (ms,95%): 0.84 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 8 tps: 10063.60 qps: 161018.18 (r/w/o: 140890.98/0.00/20127.20) lat (ms,95%): 0.84 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 8 tps: 10026.10 qps: 160417.50 (r/w/o: 140365.30/0.00/20052.20) lat (ms,95%): 0.84 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 8 tps: 10047.90 qps: 160767.60 (r/w/o: 140671.80/0.00/20095.80) lat (ms,95%): 0.84 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 8 tps: 10025.20 qps: 160401.75 (r/w/o: 140351.35/0.00/20050.39) lat (ms,95%): 0.84 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 8 tps: 10071.07 qps: 161137.60 (r/w/o: 140995.56/0.00/20142.04) lat (ms,95%): 0.84 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            16722216
        write:                           0
        other:                           2388888
        total:                           19111104
    transactions:                        1194444 (9953.56 per sec.)
    queries:                             19111104 (159256.94 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      9953.5588
    time elapsed:                        120.0017s
    total number of events:              1194444

Latency (ms):
         min:                                    0.64
         avg:                                    0.80
         max:                                   31.52
         95th percentile:                        0.86
         sum:                               959103.95

Threads fairness:
    events (avg/stddev):           149305.5000/2352.76
    execution time (avg/stddev):   119.8880/0.00

[SUCCESS] Read-Only benchmark completed

=====================================================================
WRITE-ONLY BENCHMARK (2 minutes)
=====================================================================

[2025-06-06 05:25:12] Running Write-Only benchmark (2 minutes)...
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 8 tps: 1091.15 qps: 6550.89 (r/w/o: 0.00/4367.79/2183.10) lat (ms,95%): 30.26 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 1036.50 qps: 6219.01 (r/w/o: 0.00/4146.01/2073.00) lat (ms,95%): 26.20 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 330.70 qps: 1984.20 (r/w/o: 0.00/1322.80/661.40) lat (ms,95%): 40.37 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 8 tps: 1151.20 qps: 6907.20 (r/w/o: 0.00/4604.80/2302.40) lat (ms,95%): 24.38 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 8 tps: 299.70 qps: 1798.20 (r/w/o: 0.00/1198.80/599.40) lat (ms,95%): 39.65 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 8 tps: 1131.50 qps: 6789.00 (r/w/o: 0.00/4526.00/2263.00) lat (ms,95%): 29.19 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 8 tps: 323.70 qps: 1942.20 (r/w/o: 0.00/1294.80/647.40) lat (ms,95%): 39.65 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 8 tps: 1117.80 qps: 6706.80 (r/w/o: 0.00/4471.20/2235.60) lat (ms,95%): 30.81 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 8 tps: 419.70 qps: 2518.20 (r/w/o: 0.00/1678.80/839.40) lat (ms,95%): 38.94 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 8 tps: 1029.90 qps: 6179.40 (r/w/o: 0.00/4119.60/2059.80) lat (ms,95%): 36.24 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 8 tps: 523.70 qps: 3142.20 (r/w/o: 0.00/2094.80/1047.40) lat (ms,95%): 38.94 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 8 tps: 939.40 qps: 5636.40 (r/w/o: 0.00/3757.60/1878.80) lat (ms,95%): 37.56 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           375832
        other:                           187916
        total:                           563748
    transactions:                        93958  (782.88 per sec.)
    queries:                             563748 (4697.27 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      782.8780
    time elapsed:                        120.0161s
    total number of events:              93958

Latency (ms):
         min:                                    1.50
         avg:                                   10.22
         max:                                  176.03
         95th percentile:                       37.56
         sum:                               959972.04

Threads fairness:
    events (avg/stddev):           11744.7500/0.43
    execution time (avg/stddev):   119.9965/0.01

[SUCCESS] Write-Only benchmark completed

=====================================================================
READ-WRITE BENCHMARK (2 minutes)
=====================================================================

[2025-06-06 05:27:12] Running Read-Write benchmark (2 minutes)...
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 8 tps: 371.48 qps: 7444.86 (r/w/o: 5211.96/1489.13/743.77) lat (ms,95%): 40.37 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 326.10 qps: 6522.02 (r/w/o: 4565.41/1304.40/652.20) lat (ms,95%): 127.81 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 282.90 qps: 5657.98 (r/w/o: 3960.58/1131.60/565.80) lat (ms,95%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 8 tps: 623.10 qps: 12459.60 (r/w/o: 8722.60/2490.80/1246.20) lat (ms,95%): 30.81 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 8 tps: 262.80 qps: 5258.39 (r/w/o: 3679.99/1052.80/525.60) lat (ms,95%): 39.65 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 8 tps: 816.40 qps: 16328.03 (r/w/o: 11429.62/3265.61/1632.80) lat (ms,95%): 31.94 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 8 tps: 305.20 qps: 6098.09 (r/w/o: 4268.50/1219.20/610.40) lat (ms,95%): 42.61 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 8 tps: 594.00 qps: 11885.96 (r/w/o: 8320.34/2377.61/1188.01) lat (ms,95%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 8 tps: 603.30 qps: 12063.65 (r/w/o: 8445.86/2411.19/1206.59) lat (ms,95%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 8 tps: 395.90 qps: 7917.50 (r/w/o: 5541.70/1584.00/791.80) lat (ms,95%): 38.94 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 8 tps: 807.20 qps: 16146.80 (r/w/o: 11302.00/3230.40/1614.40) lat (ms,95%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 8 tps: 292.60 qps: 5851.99 (r/w/o: 4096.40/1170.40/585.20) lat (ms,95%): 40.37 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            795452
        write:                           227272
        other:                           113636
        total:                           1136360
    transactions:                        56818  (473.35 per sec.)
    queries:                             1136360 (9467.00 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      473.3501
    time elapsed:                        120.0338s
    total number of events:              56818

Latency (ms):
         min:                                    1.57
         avg:                                   16.90
         max:                                  197.51
         95th percentile:                       38.94
         sum:                               960127.98

Threads fairness:
    events (avg/stddev):           7102.2500/25.34
    execution time (avg/stddev):   120.0160/0.01

[SUCCESS] Read-Write benchmark completed

=====================================================================
OLTP POINT SELECT BENCHMARK
=====================================================================

[2025-06-06 05:29:12] Running OLTP Point Select benchmark...
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            1969014
        write:                           0
        other:                           0
        total:                           1969014
    transactions:                        1969014 (196725.94 per sec.)
    queries:                             1969014 (196725.94 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      196725.9383
    time elapsed:                        10.0089s
    total number of events:              1969014

Latency (ms):
         min:                                    0.02
         avg:                                    0.04
         max:                                   30.53
         95th percentile:                        0.06
         sum:                                79731.10

Threads fairness:
    events (avg/stddev):           246126.7500/2379.33
    execution time (avg/stddev):   9.9664/0.00

[SUCCESS] OLTP Point Select benchmark completed

=====================================================================
OLTP UPDATE INDEX BENCHMARK
=====================================================================

[2025-06-06 05:29:22] Running OLTP Update Index benchmark...
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            0
        write:                           19676
        other:                           0
        total:                           19676
    transactions:                        19676  (1961.93 per sec.)
    queries:                             19676  (1961.93 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      1961.9260
    time elapsed:                        10.0289s
    total number of events:              19676

Latency (ms):
         min:                                    1.12
         avg:                                    4.07
         max:                                  138.33
         95th percentile:                       21.89
         sum:                                80142.60

Threads fairness:
    events (avg/stddev):           2459.5000/0.50
    execution time (avg/stddev):   10.0178/0.01

[SUCCESS] OLTP Update Index benchmark completed
[2025-06-06 05:29:33] Starting K6 benchmarks...
[2025-06-06 05:29:33] Truncating cache table...
TRUNCATE TABLE
[SUCCESS] Cache table truncated

=====================================================================
K6 AOT INSERT TEST
=====================================================================

[2025-06-06 05:29:33] Running K6 AOT Insert test...

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: ./k6/aot/insert-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 80 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 100000 iterations shared among 80 VUs (maxDuration: 10m0s, gracefulStop: 30s)


running (00m01.0s), 80/80 VUs, 17889 complete and 0 interrupted iterations
default   [  18% ] 80 VUs  00m01.0s/10m0s  017889/100000 shared iters

running (00m02.0s), 80/80 VUs, 44085 complete and 0 interrupted iterations
default   [  44% ] 80 VUs  00m02.0s/10m0s  044085/100000 shared iters

running (00m03.0s), 80/80 VUs, 70177 complete and 0 interrupted iterations
default   [  70% ] 80 VUs  00m03.0s/10m0s  070177/100000 shared iters

running (00m04.0s), 80/80 VUs, 96220 complete and 0 interrupted iterations
default   [  96% ] 80 VUs  00m04.0s/10m0s  096220/100000 shared iters
time="2025-06-06T05:29:38Z" level=info msg="INFO: Insert test finished." source=console
time="2025-06-06T05:29:38Z" level=info msg="INFO: Teardown cleanup finished." source=console


  █ THRESHOLDS 

    checks{endpoint:postgres_insert}
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration{endpoint:postgres_insert}
    ✓ 'p(95)<300' p(95)=5.36ms

    http_req_failed{endpoint:postgres_insert}
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......................: 100000  24317.162555/s
    checks_succeeded...................: 100.00% 100000 out of 100000
    checks_failed......................: 0.00%   0 out of 100000

    ✓ Postgres: insert status is 200

    HTTP
    http_req_duration...........................................................: avg=3.17ms min=220.89µs med=2.69ms max=266.2ms  p(90)=4.49ms p(95)=5.36ms
      { endpoint:postgres_insert }..............................................: avg=3.17ms min=220.89µs med=2.69ms max=266.2ms  p(90)=4.49ms p(95)=5.36ms
      { expected_response:true }................................................: avg=3.17ms min=220.89µs med=2.69ms max=266.2ms  p(90)=4.49ms p(95)=5.36ms
    http_req_failed.............................................................: 0.00%  0 out of 100001
      { endpoint:postgres_insert }..............................................: 0.00%  0 out of 100000
    http_reqs...................................................................: 100001 24317.405727/s

    EXECUTION
    iteration_duration..........................................................: avg=3.26ms min=258.77µs med=2.75ms max=267.11ms p(90)=4.66ms p(95)=5.59ms
    iterations..................................................................: 100000 24317.162555/s
    vus.........................................................................: 80     min=80          max=80
    vus_max.....................................................................: 80     min=80          max=80

    NETWORK
    data_received...............................................................: 9.2 MB 2.2 MB/s
    data_sent...................................................................: 26 MB  6.3 MB/s



running (00m04.1s), 00/80 VUs, 100000 complete and 0 interrupted iterations
default ✓ [ 100% ] 80 VUs  00m04.1s/10m0s  100000/100000 shared iters
[SUCCESS] K6 AOT Insert test completed

=====================================================================
K6 AOT QUERY TEST
=====================================================================

[2025-06-06 05:29:38] Running K6 AOT Query test...

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: ./k6/aot/query-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 80 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 100000 iterations shared among 80 VUs (maxDuration: 10m0s, gracefulStop: 30s)

time="2025-06-06T05:29:38Z" level=info msg="INFO: Setting up 100 keys for query test..." source=console
time="2025-06-06T05:29:38Z" level=info msg="INFO: Setup progress... 10/100 keys inserted." source=console
time="2025-06-06T05:29:38Z" level=info msg="INFO: Setup progress... 20/100 keys inserted." source=console
time="2025-06-06T05:29:38Z" level=info msg="INFO: Setup progress... 30/100 keys inserted." source=console
time="2025-06-06T05:29:38Z" level=info msg="INFO: Setup progress... 40/100 keys inserted." source=console
time="2025-06-06T05:29:38Z" level=info msg="INFO: Setup progress... 50/100 keys inserted." source=console
time="2025-06-06T05:29:38Z" level=info msg="INFO: Setup progress... 60/100 keys inserted." source=console
time="2025-06-06T05:29:38Z" level=info msg="INFO: Setup progress... 70/100 keys inserted." source=console
time="2025-06-06T05:29:38Z" level=info msg="INFO: Setup progress... 80/100 keys inserted." source=console
time="2025-06-06T05:29:38Z" level=info msg="INFO: Setup progress... 90/100 keys inserted." source=console
time="2025-06-06T05:29:38Z" level=info msg="INFO: Setup progress... 100/100 keys inserted." source=console
time="2025-06-06T05:29:38Z" level=info msg="INFO: Setup complete. 100 keys available for querying." source=console

running (00m01.0s), 80/80 VUs, 27365 complete and 0 interrupted iterations
default   [  27% ] 80 VUs  00m01.0s/10m0s  027366/100000 shared iters

running (00m02.0s), 80/80 VUs, 56810 complete and 0 interrupted iterations
default   [  57% ] 80 VUs  00m02.0s/10m0s  056810/100000 shared iters

running (00m03.0s), 80/80 VUs, 86325 complete and 0 interrupted iterations
default   [  86% ] 80 VUs  00m03.0s/10m0s  086325/100000 shared iters
time="2025-06-06T05:29:42Z" level=info msg="INFO: Query test finished. Tested with 100 keys." source=console
time="2025-06-06T05:29:42Z" level=info msg="INFO: Teardown cleanup finished." source=console


  █ THRESHOLDS 

    checks{endpoint:postgres_get}
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration{endpoint:postgres_get}
    ✓ 'p(95)<300' p(95)=5.07ms

    http_req_failed{endpoint:postgres_get}
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......................: 300000  86482.229853/s
    checks_succeeded...................: 100.00% 300000 out of 300000
    checks_failed......................: 0.00%   0 out of 300000

    ✓ Postgres: get status is 200
    ✓ Postgres: get response has valid status
    ✓ Postgres: get response is valid JSON

    HTTP
    http_req_duration.......................................................: avg=2.65ms min=155.95µs med=2.35ms max=15.54ms p(90)=4.25ms p(95)=5.07ms
      { endpoint:postgres_get }.............................................: avg=2.65ms min=155.95µs med=2.35ms max=15.54ms p(90)=4.26ms p(95)=5.07ms
      { expected_response:true }............................................: avg=2.65ms min=155.95µs med=2.35ms max=15.54ms p(90)=4.25ms p(95)=5.07ms
    http_req_failed.........................................................: 0.00%  0 out of 100101
      { endpoint:postgres_get }.............................................: 0.00%  0 out of 100000
    http_reqs...............................................................: 100101 28856.525635/s

    EXECUTION
    iteration_duration......................................................: avg=2.73ms min=192.25µs med=2.41ms max=15.78ms p(90)=4.39ms p(95)=5.23ms
    iterations..............................................................: 100000 28827.409951/s
    vus.....................................................................: 80     min=80          max=80
    vus_max.................................................................: 80     min=80          max=80

    NETWORK
    data_received...........................................................: 21 MB  6.1 MB/s
    data_sent...............................................................: 13 MB  3.7 MB/s



running (00m03.5s), 00/80 VUs, 100000 complete and 0 interrupted iterations
default ✓ [ 100% ] 80 VUs  00m03.4s/10m0s  100000/100000 shared iters
[SUCCESS] K6 AOT Query test completed

=====================================================================
K6 NAOT INSERT TEST
=====================================================================

[2025-06-06 05:29:42] Running K6 NAOT Insert test...

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: ./k6/naot/insert-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 80 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 100000 iterations shared among 80 VUs (maxDuration: 10m0s, gracefulStop: 30s)


running (00m01.0s), 80/80 VUs, 1779 complete and 0 interrupted iterations
default   [   2% ] 80 VUs  00m01.0s/10m0s  001779/100000 shared iters

running (00m02.0s), 80/80 VUs, 20733 complete and 0 interrupted iterations
default   [  21% ] 80 VUs  00m02.0s/10m0s  020733/100000 shared iters

running (00m03.0s), 80/80 VUs, 39878 complete and 0 interrupted iterations
default   [  40% ] 80 VUs  00m03.0s/10m0s  039878/100000 shared iters

running (00m04.0s), 80/80 VUs, 59650 complete and 0 interrupted iterations
default   [  60% ] 80 VUs  00m04.0s/10m0s  059650/100000 shared iters

running (00m05.0s), 80/80 VUs, 82074 complete and 0 interrupted iterations
default   [  82% ] 80 VUs  00m05.0s/10m0s  082074/100000 shared iters
time="2025-06-06T05:29:47Z" level=info msg="INFO: Insert test finished." source=console
time="2025-06-06T05:29:47Z" level=info msg="INFO: Teardown cleanup finished." source=console


  █ THRESHOLDS 

    checks{endpoint:postgres_insert}
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration{endpoint:postgres_insert}
    ✓ 'p(95)<300' p(95)=6.54ms

    http_req_failed{endpoint:postgres_insert}
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......................: 100000  17553.700084/s
    checks_succeeded...................: 100.00% 100000 out of 100000
    checks_failed......................: 0.00%   0 out of 100000

    ✓ Postgres: insert status is 200

    HTTP
    http_req_duration...........................................................: avg=4.43ms min=264.84µs med=3.45ms max=881.21ms p(90)=5.6ms  p(95)=6.54ms
      { endpoint:postgres_insert }..............................................: avg=4.43ms min=264.84µs med=3.45ms max=881.21ms p(90)=5.6ms  p(95)=6.54ms
      { expected_response:true }................................................: avg=4.43ms min=264.84µs med=3.45ms max=881.21ms p(90)=5.6ms  p(95)=6.54ms
    http_req_failed.............................................................: 0.00%  0 out of 100001
      { endpoint:postgres_insert }..............................................: 0.00%  0 out of 100000
    http_reqs...................................................................: 100001 17553.875621/s

    EXECUTION
    iteration_duration..........................................................: avg=4.52ms min=316.39µs med=3.51ms max=881.58ms p(90)=5.77ms p(95)=6.79ms
    iterations..................................................................: 100000 17553.700084/s
    vus.........................................................................: 80     min=80          max=80
    vus_max.....................................................................: 80     min=80          max=80

    NETWORK
    data_received...............................................................: 9.2 MB 1.6 MB/s
    data_sent...................................................................: 26 MB  4.6 MB/s



running (00m05.7s), 00/80 VUs, 100000 complete and 0 interrupted iterations
default ✓ [ 100% ] 80 VUs  00m05.7s/10m0s  100000/100000 shared iters
[SUCCESS] K6 NAOT Insert test completed

=====================================================================
K6 NAOT QUERY TEST
=====================================================================

[2025-06-06 05:29:48] Running K6 NAOT Query test...

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: ./k6/naot/query-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 80 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 100000 iterations shared among 80 VUs (maxDuration: 10m0s, gracefulStop: 30s)

time="2025-06-06T05:29:48Z" level=info msg="INFO: Setting up 100 keys for query test..." source=console
time="2025-06-06T05:29:48Z" level=info msg="INFO: Setup progress... 10/100 keys inserted." source=console
time="2025-06-06T05:29:48Z" level=info msg="INFO: Setup progress... 20/100 keys inserted." source=console
time="2025-06-06T05:29:48Z" level=info msg="INFO: Setup progress... 30/100 keys inserted." source=console
time="2025-06-06T05:29:48Z" level=info msg="INFO: Setup progress... 40/100 keys inserted." source=console
time="2025-06-06T05:29:48Z" level=info msg="INFO: Setup progress... 50/100 keys inserted." source=console
time="2025-06-06T05:29:48Z" level=info msg="INFO: Setup progress... 60/100 keys inserted." source=console
time="2025-06-06T05:29:48Z" level=info msg="INFO: Setup progress... 70/100 keys inserted." source=console
time="2025-06-06T05:29:48Z" level=info msg="INFO: Setup progress... 80/100 keys inserted." source=console
time="2025-06-06T05:29:48Z" level=info msg="INFO: Setup progress... 90/100 keys inserted." source=console
time="2025-06-06T05:29:48Z" level=info msg="INFO: Setup progress... 100/100 keys inserted." source=console
time="2025-06-06T05:29:48Z" level=info msg="INFO: Setup complete. 100 keys available for querying." source=console

running (00m01.0s), 80/80 VUs, 25263 complete and 0 interrupted iterations
default   [  25% ] 80 VUs  00m01.0s/10m0s  025263/100000 shared iters

running (00m02.0s), 80/80 VUs, 54073 complete and 0 interrupted iterations
default   [  54% ] 80 VUs  00m02.0s/10m0s  054073/100000 shared iters

running (00m03.0s), 80/80 VUs, 84093 complete and 0 interrupted iterations
default   [  84% ] 80 VUs  00m03.0s/10m0s  084093/100000 shared iters
time="2025-06-06T05:29:51Z" level=info msg="INFO: Query test finished. Tested with 100 keys." source=console
time="2025-06-06T05:29:51Z" level=info msg="INFO: Teardown cleanup finished." source=console


  █ THRESHOLDS 

    checks{endpoint:postgres_get}
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration{endpoint:postgres_get}
    ✓ 'p(95)<300' p(95)=5.11ms

    http_req_failed{endpoint:postgres_get}
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......................: 300000  85006.512722/s
    checks_succeeded...................: 100.00% 300000 out of 300000
    checks_failed......................: 0.00%   0 out of 300000

    ✓ Postgres: get status is 200
    ✓ Postgres: get response has valid status
    ✓ Postgres: get response is valid JSON

    HTTP
    http_req_duration.......................................................: avg=2.7ms  min=158.23µs med=2.39ms max=33.57ms p(90)=4.23ms p(95)=5.11ms
      { endpoint:postgres_get }.............................................: avg=2.7ms  min=158.23µs med=2.39ms max=33.57ms p(90)=4.23ms p(95)=5.11ms
      { expected_response:true }............................................: avg=2.7ms  min=158.23µs med=2.39ms max=33.57ms p(90)=4.23ms p(95)=5.11ms
    http_req_failed.........................................................: 0.00%  0 out of 100101
      { endpoint:postgres_get }.............................................: 0.00%  0 out of 100000
    http_reqs...............................................................: 100101 28364.1231/s

    EXECUTION
    iteration_duration......................................................: avg=2.78ms min=196.48µs med=2.44ms max=34.13ms p(90)=4.39ms p(95)=5.32ms
    iterations..............................................................: 100000 28335.504241/s
    vus.....................................................................: 80     min=80          max=80
    vus_max.................................................................: 80     min=80          max=80

    NETWORK
    data_received...........................................................: 21 MB  6.0 MB/s
    data_sent...............................................................: 13 MB  3.6 MB/s



running (00m03.5s), 00/80 VUs, 100000 complete and 0 interrupted iterations
default ✓ [ 100% ] 80 VUs  00m03.5s/10m0s  100000/100000 shared iters
[SUCCESS] K6 NAOT Query test completed
[SUCCESS] All available K6 benchmarks completed
[2025-06-06 05:29:51] Cleaning up PostgreSQL test data...

=====================================================================
POSTGRESQL CLEANUP
=====================================================================

sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Dropping table 'sbtest1'...
Dropping table 'sbtest2'...
Dropping table 'sbtest3'...
Dropping table 'sbtest4'...
Dropping table 'sbtest5'...
Dropping table 'sbtest6'...
Dropping table 'sbtest7'...
Dropping table 'sbtest8'...
Dropping table 'sbtest9'...
Dropping table 'sbtest10'...
[SUCCESS] PostgreSQL cleanup completed

=====================================================================
BENCHMARK COMPLETION
=====================================================================
End Time: Fri Jun  6 05:29:51 UTC 2025
Duration: 12 minutes and 16 seconds
Results saved to: sysbench_results_r7a.2xlarge_20250606_051735.txt
=====================================================================
[2025-06-06 05:29:51] ================================================
[SUCCESS] All benchmarks completed successfully!
[2025-06-06 05:29:51] Detailed results saved to: sysbench_results_r7a.2xlarge_20250606_051735.txt